Revit 2026 API

# FailuresAccessorGetSeverity Method

---

Provides access to the current failure severity.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureSeverity GetSeverity()
```
```vb
Public Function GetSeverity As FailureSeverity
```
```cpp
public:
FailureSeverity GetSeverity()
```
```fsharp
member GetSeverity : unit -> FailureSeverity
```

#### Return Value

FailureSeverity The highest severity of a failure message currently posted in the document.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace